In [60]:
import pandas as pd
import numpy as np

In [61]:
df = pd.read_csv(r"datos\ds_salaries.csv")
import os 
print(os.getcwd())

c:\Users\Ral\Documents\GitHub\Data-Science-Salaries

### PREPROCESAMIENTO

In [62]:
df.head()

,work_year,experience_level,employment_type,job_title,salary,salary_currency,salary_in_usd,employee_residence,remote_ratio,company_location,company_size
0,2023,SE,FT,Principal Data Scientist,80000,EUR,85847,ES,100,ES,L
1,2023,MI,CT,ML Engineer,30000,USD,30000,US,100,US,S
2,2023,MI,CT,ML Engineer,25500,USD,25500,US,100,US,S
3,2023,SE,FT,Data Scientist,175000,USD,175000,CA,100,CA,M
4,2023,SE,FT,Data Scientist,120000,USD,120000,CA,100,CA,M

In [63]:
df.columns #saber las columnas

Index(['work_year', 'experience_level', 'employment_type', 'job_title',
       'salary', 'salary_currency', 'salary_in_usd', 'employee_residence',
       'remote_ratio', 'company_location', 'company_size'],
      dtype='object')

In [64]:
df.shape #saber las dimensiones

(3755, 11)

In [65]:
df.dtypes #saber los tipos de datos

work_year              int64
experience_level      object
employment_type       object
job_title             object
salary                 int64
salary_currency       object
salary_in_usd          int64
employee_residence    object
remote_ratio           int64
company_location      object
company_size          object
dtype: object

In [66]:
df.isnull().sum() #saber los valores nulos

work_year             0
experience_level      0
employment_type       0
job_title             0
salary                0
salary_currency       0
salary_in_usd         0
employee_residence    0
remote_ratio          0
company_location      0
company_size          0
dtype: int64

In [67]:
df.duplicated().sum() #saber los valores duplicados

np.int64(1171)

In [68]:
def mas_repetidos(df):
    df_duplicados = df[df.duplicated(keep=False)]
    df_agrupado = df_duplicados.groupby(df.columns.tolist()).size().reset_index().rename(columns={0: 'count'})
    df_ordenado = df_agrupado.sort_values(by='count', ascending=False)
    return df_ordenado

mas_repetidos(df)

,work_year,experience_level,employment_type,job_title,salary,salary_currency,salary_in_usd,employee_residence,remote_ratio,company_location,company_size,count
223,2022,SE,FT,Data Scientist,191475,USD,191475,US,100,US,M,21
201,2022,SE,FT,Data Scientist,141525,USD,141525,US,100,US,M,21
399,2023,SE,FT,Data Engineer,129000,USD,129000,US,0,US,M,13
441,2023,SE,FT,Data Engineer,252000,USD,252000,US,0,US,M,13
221,2022,SE,FT,Data Scientist,185900,USD,185900,US,0,US,M,12
...,...,...,...,...,...,...,...,...,...,...,...,...
510,2023,SE,FT,Data Scientist,239748,USD,239748,US,0,US,M,2
508,2023,SE,FT,Data Scientist,228000,USD,228000,US,0,US,M,2
507,2023,SE,FT,Data Scientist,225000,USD,225000,US,100,US,M,2
504,2023,SE,FT,Data Scientist,201000,USD,201000,US,0,US,M,2
503,2023,SE,FT,Data Scientist,200160,USD,200160,US,0,US,M,2

In [69]:
df.drop_duplicates(inplace=True) #eliminar duplicados

In [70]:
df.shape

(2584, 11)

### EDA

In [71]:
df.head(5)

,work_year,experience_level,employment_type,job_title,salary,salary_currency,salary_in_usd,employee_residence,remote_ratio,company_location,company_size
0,2023,SE,FT,Principal Data Scientist,80000,EUR,85847,ES,100,ES,L
1,2023,MI,CT,ML Engineer,30000,USD,30000,US,100,US,S
2,2023,MI,CT,ML Engineer,25500,USD,25500,US,100,US,S
3,2023,SE,FT,Data Scientist,175000,USD,175000,CA,100,CA,M
4,2023,SE,FT,Data Scientist,120000,USD,120000,CA,100,CA,M

¿Que pais tiene mas compañias de tamaño grande?

In [72]:
maxnum_companies = df.loc[(df['company_size'] == 'L', ['company_location'])].value_counts()
maxnum_companies.head(1)

company_location
US                  220
Name: count, dtype: int64

En que puesto se gana mas

In [73]:
job_salary = df.groupby(['job_title', 'company_location'])['salary_in_usd'].max().reset_index()
job_higher_salary = job_salary.sort_values(by='salary_in_usd', ascending=False)

job_higher_salary.head(5)

                              job_title company_location  salary_in_usd
351                  Research Scientist               US         450000
101                        Data Analyst               GB         430967
20                         AI Scientist               IL         423834
40   Applied Machine Learning Scientist               US         423000
331            Principal Data Scientist               US         416000

Tipo de trabajo, pais de residencia donde mas se cobra?

In [74]:
df.groupby(["job_title", "employee_residence"])["salary_in_usd"].max().reset_index()

                         job_title employee_residence  salary_in_usd
0    3D Computer Vision Researcher                 AS          20000
1    3D Computer Vision Researcher                 CA          10000
2    3D Computer Vision Researcher                 IN           5409
3    3D Computer Vision Researcher                 US          50000
4                     AI Developer                 BA         120000
..                             ...                ...            ...
377             Research Scientist                 US         450000
378         Software Data Engineer                 NG          50000
379         Software Data Engineer                 SG          75020
380             Staff Data Analyst                 NG          15000
381           Staff Data Scientist                 US         105000

[382 rows x 3 columns]

¿El nivel de  experiencia es proporcional al salario

In [75]:
exp_lev = df["experience_level"].value_counts()
exp_lev

experience_level
SE    1554
MI     664
EN     270
EX      96
Name: count, dtype: int64

cuanto se cobra de media por cada nivel de experiencia?

In [76]:
df.groupby(["experience_level","employment_type"])["salary_in_usd"].mean().reset_index().sort_values(by=["experience_level","employment_type"], ascending= False)

   experience_level employment_type  salary_in_usd
12               SE              FT  154165.019367
11               SE              FL   53333.333333
10               SE              CT   97500.000000
9                MI              PT   42561.000000
8                MI              FT  102742.781874
7                MI              FL   41615.600000
6                MI              CT   78600.000000
5                EX              FT  188710.610526
4                EX              CT  416000.000000
3                EN              PT   38885.000000
2                EN              FT   74564.626984
1                EN              FL   75000.000000
0                EN              CT   65234.500000

en qué tamaño de compañía trabajan más

In [77]:
df.groupby(["company_location", "company_size"])["salary_in_usd"].mean().reset_index().sort_values(by=["company_location"], ascending= False)

    company_location company_size  salary_in_usd
132               VN            L   12000.000000
131               US            S  105847.339623
130               US            M  153984.837560
129               US            L  151464.422727
128               UA            S   50000.000000
..               ...          ...            ...
5                 AR            S   13000.000000
3                 AM            S   50000.000000
2                 AL            S   10000.000000
1                 AE            S   92500.000000
0                 AE            L  115000.000000

[133 rows x 3 columns]

por que porcentage promedio se aumenta el salario entre nivel de experiencia

In [78]:
df.groupby("experience_level")["salary_in_usd"].mean()

experience_level
EN     72648.685185
EX    191078.208333
MI    101828.783133
SE    153897.435650
Name: salary_in_usd, dtype: float64

en que pais se cobra  mas por tipo de empleo?

In [79]:
df.groupby("experience_level")["salary_in_usd"].mean()

experience_level
EN     72648.685185
EX    191078.208333
MI    101828.783133
SE    153897.435650
Name: salary_in_usd, dtype: float64

wich are experience level more required

In [80]:
df.groupby(["job_title","experience_level"]).size()

job_title                      experience_level
3D Computer Vision Researcher  EN                   2
                               MI                   1
                               SE                   1
AI Developer                   EN                   6
                               MI                   2
                                                   ..
Research Scientist             SE                  34
Software Data Engineer         MI                   1
                               SE                   1
Staff Data Analyst             EX                   1
Staff Data Scientist           SE                   1
Length: 192, dtype: int64

quiero decir, cuáles se repiten más en este set de datos, las empresas medianas, grandes o pequeñas

In [82]:
total_size_per_location = df.groupby("company_location")["company_size"].sum()
location_with_largest_size = total_size_per_location.idxmax()
total_size = total_size_per_location.max()

print(f"La ubicación con el mayor tamaño de compañía es: {location_with_largest_size} con un tamaño total de {total_size}.")

La ubicación con el mayor tamaño de compañía es: JP con un tamaño total de SSSSSS.